import time, random

class Atbb():

  def __init__(self):

    self.search_object_type = {
        "売土地" : "01",
        "売戸建" : "02",
        "売マンション" : "03",
        "売事業用" : "04",
        "売リゾート向け" : "05",
        "賃貸居住用" : "06",
        "賃貸事業用" : "07",
        "貸土地" : "08",
        "貸駐車場" : "09",
    }

    self.search_location_line = {
      "北海道全域" : "0101",
      "札幌市" : "0102",
      "札幌市周辺" : "0103",
      "道央" : "0104",
      "道東" : "0105",
      "道北" : "0106",
      "道南" : "0107",
      "青森県" : "02",
      "岩手県" : "03",
      "宮城県" : "04",
      "秋田県" : "05",
      "山形県" : "06",
      "福島県" : "07",
      "茨城県" : "08",
      "栃木県" : "09",
      "群馬県" : "10",
      "埼玉県" : "11",
      "千葉県" : "12",
      "東京都" : "13",
      "神奈川県" : "14",
      "新潟県" : "15",
      "富山県" : "16",
      "石川県" : "17",
      "福井県" : "18",
      "山梨県" : "19",
      "長野県" : "20",
      "岐阜県" : "21",
      "静岡県" : "22",
      "愛知県" : "23",
      "三重県" : "24",
      "滋賀県" : "25",
      "京都府" : "26",
      "大阪府" : "27",
      "兵庫県" : "28",
      "奈良県" : "29",
      "和歌山県" : "30",
      "鳥取県" : "31",
      "島根県" : "32",
      "岡山県" : "33",
      "広島県" : "34",
      "山口県" : "35",
      "徳島県" : "36",
      "香川県" : "37",
      "愛媛県" : "38",
      "高知県" : "39",
      "福岡県" : "40",
      "佐賀県" : "41",
      "長崎県" : "42",
      "熊本県" : "43",
      "大分県" : "44",
      "宮崎県" : "45",
      "鹿児島県" : "46",
      "沖縄県" : "47",
    }

    self.search_result_headers = [
      "物件種目",
      "所在地",
      "建物名",
      "publish_date",
      "賃料",
      "沿線駅",
      "礼金",
      "共益費",
      "築年月",
      "ad",
      "敷金",
      "使用部分面積",
      "所在階",
      "取引態様",
      "敷引",
      "坪単価",
      "struct_type",
      "間取",
      "商号",
      "電話番号",
      "license",
      "image_number",
    ]

  def randomStaticSleep(self):

    # Generate Random Decimal from 4.5 - 5.5
    rand_time = round(random.uniform(4.5, 5.5), 1)
    # Sleep
    time.sleep(rand_time)
