<?php

return [

    'USER_TYPE' => [
        1 => 'admin',
        2 => 'customer',
        3 => 'broker',
    ],
    'license' => [
            1  => '国土交通大臣免許',  
            2  => '北海道（オホ）知事免許',  
            3  => '北海道（空知）知事免許',  
            4  => '北海道（釧路）知事免許',  
            5  => '北海道（後志）知事免許',  
            6  => '北海道（根室）知事免許',  
            7  => '北海道（宗谷）知事免許',  
            8  => '北海道（十勝）知事免許',  
            9  => '北海道（上川）知事免許',  
            10 => '北海道（石狩）知事免許',  
            11 => '北海道（胆振）知事免許',  
            12 => '北海道（渡島）知事免許',  
            13 => '北海道（日高）知事免許',  
            14 => '北海道（留萌）知事免許',  
            15 => '北海道（檜山）知事免許',  
            16 => '青森県知事免許',  
            17 => '岩手県知事免許',  
            18 => '宮城県知事免許',  
            19 => '秋田県知事免許',  
            20 => '山形県知事免許',  
            21 => '福島県知事免許',  
            22 => '茨城県知事免許',  
            23 => '栃木県知事免許',  
            24 => '群馬県知事免許',  
            25 => '埼玉県知事免許',  
            26 => '千葉県知事免許',  
            27 => '東京都知事免許',  
            28 => '神奈川県知事免許',  
            29 => '新潟県知事免許',  
            30 => '富山県知事免許',  
            31 => '石川県知事免許',  
            32 => '福井県知事免許',  
            33 => '山梨県知事免許',  
            34 => '長野県知事免許',  
            35 => '岐阜県知事免許',  
            36 => '静岡県知事免許',  
            37 => '愛知県知事免許',  
            38 => '三重県知事免許',  
            39 => '滋賀県知事免許',  
            40 => '京都府知事免許',  
            41 => '大阪府知事免許',  
            42 => '兵庫県知事免許',  
            43 => '奈良県知事免許',  
            44 => '和歌山県知事免許',  
            45 => '鳥取県知事免許',  
            46 => '島根県知事免許',  
            47 => '岡山県知事免許',  
            48 => '広島県知事免許',  
            49 => '山口県知事免許',  
            50 => '徳島県知事免許',  
            51 => '香川県知事免許',  
            52 => '愛媛県知事免許',  
            53 => '高知県知事免許',  
            54 => '福岡県知事免許',  
            55 => '佐賀県知事免許',  
            56 => '長崎県知事免許',  
            57 => '熊本県知事免許',  
            58 => '大分県知事免許',  
            59 => '宮崎県知事免許',  
            60 => '鹿児島県知事免許',  
            61 => '沖縄県知事免許',  
    ],
    // In Order
    // 'pref' => [
    //     1 => '北海道',
    //     2 => '青森県',
    //     3 => '岩手県',
    //     4 => '宮城県',
    //     5 => '秋田県',
    //     6 => '山形県',
    //     7 => '福島県',
    //     8 => '茨城県',
    //     9 => '栃木県',
    //     10 => '群馬県',
    //     11 => '埼玉県',
    //     12 => '千葉県',
    //     13 => '東京都',
    //     14 => '神奈川県',
    //     15 => '新潟県',
    //     16 => '富山県',
    //     17 => '石川県',
    //     18 => '福井県',
    //     19 => '山梨県',
    //     20 => '長野県',
    //     21 => '岐阜県',
    //     22 => '静岡県',
    //     23 => '愛知県',
    //     24 => '三重県',
    //     25 => '滋賀県',
    //     26 => '京都府',
    //     27 => '大阪府',
    //     28 => '兵庫県',
    //     29 => '奈良県',
    //     30 => '和歌山県',
    //     31 => '鳥取県',
    //     32 => '島根県',
    //     33 => '岡山県',
    //     34 => '広島県',
    //     35 => '山口県',
    //     36 => '徳島県',
    //     37 => '香川県',
    //     38 => '愛媛県',
    //     39 => '高知県',
    //     40 => '福岡県',
    //     41 => '佐賀県',
    //     42 => '長崎県',
    //     43 => '熊本県',
    //     44 => '大分県',
    //     45 => '宮崎県',
    //     46 => '鹿児島県',
    //     47 => '沖縄県',
    // ],

    // Re-ordered
    'pref' => [
        1 => '北海道',
        //
        4 => '宮城県',
        2 => '青森県',
        3 => '岩手県',
        5 => '秋田県',
        6 => '山形県',
        7 => '福島県',
        //
        13 => '東京都',
        14 => '神奈川県',
        12 => '千葉県',
        11 => '埼玉県',
        8 => '茨城県',
        9 => '栃木県',
        10 => '群馬県',
        //
        15 => '新潟県',
        16 => '富山県',
        17 => '石川県',
        18 => '福井県',
        //
        23 => '愛知県',
        22 => '静岡県',
        21 => '岐阜県',
        24 => '三重県',
        19 => '山梨県',
        20 => '長野県',
        //
        28 => '兵庫県',
        27 => '大阪府',
        26 => '京都府',
        29 => '奈良県',
        25 => '滋賀県',
        30 => '和歌山県',
        //
        33 => '岡山県',
        34 => '広島県',
        35 => '山口県',
        32 => '島根県',
        31 => '鳥取県',
        //
        37 => '香川県',
        38 => '愛媛県',
        36 => '徳島県',
        39 => '高知県',
        //
        40 => '福岡県',
        44 => '大分県',
        41 => '佐賀県',
        42 => '長崎県',
        43 => '熊本県',
        45 => '宮崎県',
        46 => '鹿児島県',
        47 => '沖縄県',
    ],

    'plan_of_house' => [
        0 => '1R',
        1 => '1K',
        2 => '2K',
        3 => '3K',
        4 => '4K',
        5 => '1DK',
        6 => '2DK',
        7 => '3DK',
        8 => '4DK',
        9 => '1LDK',
        10 => '2LDK',
        11 => '3LDK',
        12 => '4LDK',
    ],

    'building_structures' => [
        0 => '木造',
        1 => 'ブロック造',
        2 => '鉄骨造',
        3 => 'ＲＣ',
        4 => 'ＳＲＣ',
        5 => 'ＰＣ',
        6 => 'ＨＰＣ',
        7 => '軽量鉄骨造',
        8 => 'ＡＬＣ',
        9 => 'その他',
    ],

    'object_type' => [
        0 => 'マンション',
        1 => 'アパート',
        2 => '戸建',
        3  => 'テラスハウス',
        4 => 'タウンハウス',
        5 => 'その他',
    ],

    // 'prefectures' => [
    //     0 => '東京都',
    //     1 => '千葉県',
    //     2 => '埼玉県',
    // ],

    'prefectures' => [
        12 => '北海道',
        11 => '青森県',
        3 => '岩手県',
        4 => '宮城県',
        5 => '秋田県',
        6 => '山形県',
        7 => '福島県',
        8 => '茨城県',
        9 => '栃木県',
        10 => '群馬県',
        2 => '埼玉県',
        1 => '千葉県',
        0 => '東京都',
        14 => '神奈川県',
        15 => '山梨県',
        16 => '長野県',
        17 => '新潟県',
        18 => '富山県',
        19 => '石川県',
        20 => '福井県',
        21 => '岐阜県',
        22 => '静岡県',
        23 => '愛知県',
        24 => '三重県',
        25 => '滋賀県',
        26 => '京都府',
        27 => '大阪府',
        28 => '兵庫県',
        29 => '奈良県',
        30 => '和歌山県',
        31 => '鳥取県',
        32 => '島根県',
        33 => '岡山県',
        34 => '広島県',
        35 => '山口県',
        36 => '徳島県',
        37 => '香川県',
        38 => '愛媛県',
        39 => '高知県',
        40 => '福岡県',
        41 => '佐賀県',
        42 => '長崎県',
        43 => '熊本県',
        44 => '大分県',
        45 => '宮崎県',
        46 => '鹿児島県',
        47 => '沖縄県'
    ],
    'cities' => [
        '神奈川県' => [
            "横浜市",
            "横浜市鶴見区",
            "横浜市神奈川区",
        ],
        '山梨県' => [
            "新潟市",
            "新潟市北区",
            "新潟市東区",
        ],
        '長野県' => [
            "富山市",
            "高岡市",
            "魚津市",
        ],
        '新潟県' => [
            "金沢市",
            "七尾市",
            "小松市",
        ],
        '北海道' => [
            "千葉市",
            "千葉市中央区",
            "千葉市花見川区",
        ],
        '青森県' => [
            "さいたま市",
            "さいたま市西区",
            "さいたま市北区",
        ],
        '岩手県' => [
            "盛岡市",
            "宮古市",
            "大船渡市",
        ],
        '宮城県' => [
            "仙台市",
            "仙台市青葉区",
            "仙台市宮城野区",
        ],
        '秋田県' => [
            "秋田市",
            "能代市",
            "横手市",
        ],
        '山形県' => [
            "山形市",
            "米沢市",
            "鶴岡市",
        ],
        '福島県' => [
            "福島市",
            "会津若松市",
            "郡山市",
        ],
        '茨城県' => [
            "水戸市",
            "日立市",
            "土浦市",
        ],

        '栃木県' => [
            "宇都宮市",
            "足利市",
            "栃木市",
        ],
        '群馬県' => [
            "前橋市",
            "高崎市",
            "桐生市",
        ],
        '愛媛県' => [
            "松山市",
            "今治市",
            "宇和島市",
        ],
        '高知県' => [
            "高知市",
            "室戸市",
            "安芸市",
        ],
        '福岡県' => [
            "北九州市",
            "北九州市門司区",
            "北九州市若松区",
        ],
        '佐賀県' => [
            "佐賀市",
            "唐津市",
            "鳥栖市",
        ],
        '長崎県' => [
            "長崎市",
            "佐世保市",
            "島原市",
        ],
        '熊本県' => [
            "熊本市",
            "熊本市中央区",
            "熊本市東区",
        ],
        '大分県' => [
            "大分市",
            "別府市",
            "中津市",
        ],
        '宮崎県' => [
            "宮崎市",
            "都城市",
            "延岡市",
        ],
        '鹿児島県' => [
            "鹿児島市",
            "鹿屋市",
            "枕崎市",
        ],
        '沖縄県' => [
            "那覇市",
            "宜野湾市",
            "石垣市",
        ],
        '富山県' => [
            "福井市",
            "敦賀市",
            "小浜市",
        ],

        '石川県' => [
            "甲府市",
            "富士吉田市",
            "都留市",
        ],

        '福井県' => [
            "長野市",
            "松本市",
            "上田市",
        ],

        '岐阜県' => [
            "岐阜市",
            "大垣市",
            "高山市",
        ],

        '静岡県' => [
            "静岡市",
            "静岡市葵区",
            "静岡市駿河区",
        ],

        '愛知県' => [
            "名古屋市",
            "名古屋市千種区",
            "名古屋市東区",
        ],

        '三重県' => [
            "津市",
            "四日市市",
            "伊勢市",
        ],

        '滋賀県' => [
            "大津市",
            "彦根市",
            "長浜市",
        ],

        '京都府' => [
            "京都市",
            "京都市北区",
            "京都市上京区",
        ],

        '大阪府' => [
            "大阪市",
            "大阪市都島区",
            "大阪市福島区",
        ],
        '兵庫県' => [
            "神戸市",
            "神戸市東灘区",
            "神戸市灘区",
        ],

        '奈良県' => [
            "奈良市",
            "大和高田市",
            "大和郡山市",
            ],

        '和歌山県' => [
            "和歌山市",
            "海南市",
            "橋本市",
            ],

        '鳥取県' => [
            "鳥取市",
            "米子市",
            "倉吉市",
            ],
        '島根県' => [
            "松江市",
            "浜田市",
            "出雲市",
            ],
        '岡山県' => [
            "岡山市",
            "岡山市北区",
            "岡山市中区",
            ],
        '広島県' => [
            "広島市",
            "広島市中区",
            "広島市東区",
            ],
        '山口県' => [
            "下関市",
            "宇部市",
            "山口市",
            ],
        '徳島県' => [
            "徳島市",
            "鳴門市",
            "小松島市",
            ],
        '香川県' => [
            "高松市",
            "丸亀市",
            "坂出市",
            ],
    ],

    'city_group' => [
        0 => '品川区',
        1 => '大田区',
        2 => '横浜市中区',
    ],

    'trade_style' => [
        0 => '貸主',
        1 => '代理',
        2 => '媒介',
    ],

    'role' => [
        1 => '管理者',
        2 => 'スタッフ',
    ],

    'video_data' => [
        0 => '画像あり',
        1 => '図面あり',
    ],

    'ACCOUNT_PLANS' => [
        0 => 'トライアル',
        1 => 'スターター',
        2 => 'ベーシック',
        3 => 'エンタープライズ',
    ],

    'distributions' => [
        0 => 'レインズ',
        1 => 'at BB',
        2 => 'イタンジ',
        3 => '東急住宅リース',
        4 => '三井不動産レジデンシャルリース',
        5 => '住友不動産',
    ],
    'sites' => [
        0 => "レインズ",
        1 => "at BB",
        2 => "イタンジ",
        3 => "東急住宅リース",
        4 => "三井不動産レジデンシャルリース",
        5 => "住友不動産"
    ],
    'site_links' => [
        0 => "https://system.reins.jp/",
        1 => "https://atbb.athome.jp/",
        2 => "https://lp.itandibb.com/",
        3 => "https://map.cyber-estate.jp/mediation/login.asp?ggid=813054",
        4 => "https://membersweb.homes.co.jp/mfrl/login",
        5 => "https://www.sumitomo-latour.jp/estate/login.php"
    ],
    'leasing_material' => [
        0 => '管理費等込',
        1 => '礼金無',
        2 => '敷金等無'
    ],
    'sample_requests' => [
        'レインズ' => [
            "object_type"  => [ "マンション"],
            "prefectures"  => ["埼玉県"],
            "cities"  => [
                "埼玉県"  => ["さいたま市西区"]
            ],
            "zumen_flag" => true,
            "image_flag" => true
        ],
        'atBB' => [
            "type" => "賃貸居住用",
            "locations" => ["岐阜県"]
        ],
        'イタンジ' => [
            "object_type" => ["アパート"],
            "prefecture" => "埼玉県",
            "address" => "さいたま市西区"
        ],
        '東急住宅リース' => [
            "types" => ["マンション", "アパート"],
            "locations" => [
                "春日部市",
                "さいたま市岩槻区",
                "さいたま市南区",
                "さいたま市浦和区",
                "さいたま市大宮区",
                "さいたま市桜区",
                "さいたま市中央区",
                "戸田市",
                "新座市",
                "富士見市",
                "ふじみ野市"
            ]
        ],
        '三井不動産レジデンシャルリース' => [
            "prefectures" => ["千葉県"],
            "locations" => [],
            "madori_list" => ["ワンルーム", "1K", "1DK"]
        ],
        '住友不動産' => [
            "locations" => ["港区", "渋谷区"]
        ],
    ],'sample_requests2' => [
        'reins' => [
            "object_type"  => [ "マンション"],
            "prefectures"  => ["埼玉県"],
            "cities"  => [
                "埼玉県"  => ["さいたま市西区"]
            ],
            "zumen_flag" => true,
            "image_flag" => true
        ],
        'atbb' => [
            "type" => "賃貸居住用",
            "locations" => ["岐阜県"]
        ],
        'itandibb' => [
            "object_type" => ["アパート"],
            "prefecture" => "埼玉県",
            "address" => "さいたま市西区"
        ],
        'tokyu' => [
            "types" => ["マンション", "アパート"],
            "locations" => [
                "春日部市",
                "さいたま市岩槻区",
                "さいたま市南区",
                "さいたま市浦和区",
                "さいたま市大宮区",
                "さいたま市桜区",
                "さいたま市中央区",
                "戸田市",
                "新座市",
                "富士見市",
                "ふじみ野市"
            ]
        ],
        'mitsui' => [
            "prefectures" => ["千葉県"],
            "locations" => [],
            "madori_list" => ["ワンルーム", "1K", "1DK"]
        ],
        'sumitomo' => [
            "locations" => ["港区", "渋谷区"]
        ],
    ],

];
